app/views/admin/pages/_form_page.html.erb


  <%= f.collection_check_boxes(:images_ids, Image.all ,:id, :filename, { :prompt => "Please select"} ,{ :multiple => true})%> <br />
---
SELECT "images".* FROM "images"