app/controllers/admin/courses_controller.rb

INSERT INTO "courses" ("name", "instructor", "description", "start_date", "hour", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)
    @course.update_attribute(:day, @course.start_date.wday)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "start_date" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["start_date", "2017-07-05 17:30:00.000000"], ["updated_at", "2017-05-06 18:28:26.804789"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)