app/controllers/admin/images_controller.rb

  def edit
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @image = Image.new(image_params)
    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("filename", "name", "alt", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["filename", "IMG_20160908_113410.jpg"], ["name", "paysage1"], ["alt", "zqd"], ["caption", "eqdsd"], ["created_at", "2017-05-07 19:05:40.840864"], ["updated_at", "2017-05-07 19:05:40.840864"]]