app/controllers/admin/memberships_controller.rb

  def show
    @membership = Membership.find(params[:id])
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT 1  [["id", 6]]

  def create
    @membership = Membership.new(membership_params)

    respond_to do |format|
      if @membership.save
---
INSERT INTO "memberships" ("title", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "ekfnjdzkehrjf"], ["price", 0.0], ["created_at", "2017-05-06 02:03:20.504635"], ["updated_at", "2017-05-06 02:03:20.504635"]]

  def update
    respond_to do |format|
      if @membership.update(membership_params)
---
UPDATE "memberships" SET "description" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["description", "desc3"], ["updated_at", "2017-05-06 02:11:13.525175"], ["id", 6]]

  def destroy
    @membership.destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 6]]