app/controllers/admin/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("title", "body", "images_ids", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "egrkjngerkj"], ["body", ""], ["images_ids", "[\"\", \"1\", \"2\", \"3\"]"], ["created_at", "2017-05-06 23:15:26.682042"], ["updated_at", "2017-05-06 23:15:26.682042"]]

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(page_params)
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pages" SET "body" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["body", "modified"], ["updated_at", "2017-05-04 23:39:57.706478"], ["id", 14]]