app/controllers/contact_controller.rb

  def create
    @contact = Contact.new(message_params)
    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "phone", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dsfl"], ["phone", "lazd"], ["email", "kjnfe"], ["message", "kjnefjz"], ["created_at", "2017-05-06 16:04:23.165013"], ["updated_at", "2017-05-06 16:04:23.165013"]]