app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "dylan manin"], ["password_digest", "$2a$10$FJJZP1yUjseDHPcGTfD3oumtsajgnvoEXan39YdFfy4VLOZKs8uLu"], ["updated_at", "2017-05-04 01:57:30.758092"], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)